note/drawio/converted/dot/260506-control-unit.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_1AVZPSrsPg0MGLG_RwkN_1" [label="function_unit"];
  "n_1AVZPSrsPg0MGLG_RwkN_10" [label="dht11_unit"];
  "n_1AVZPSrsPg0MGLG_RwkN_11" [label="node_wkN-11"];
  "n_1AVZPSrsPg0MGLG_RwkN_12" [label="node_wkN-12"];
  "n_1AVZPSrsPg0MGLG_RwkN_13" [label="EVENT_SELECTOR"];
  "n_1AVZPSrsPg0MGLG_RwkN_14" [label="ACTION_DISPACTER"];
  "n_1AVZPSrsPg0MGLG_RwkN_15" [label="local_button_bus"];
  "n_1AVZPSrsPg0MGLG_RwkN_16" [label="remote_cmd_bus"];
  "n_1AVZPSrsPg0MGLG_RwkN_17" [label="canonical_evt_bus"];
  "n_1AVZPSrsPg0MGLG_RwkN_3" [label="control_pulsesrefresh_reqsnap_req"];
  "n_1AVZPSrsPg0MGLG_RwkN_4" [label="control_unit"];
  "n_1AVZPSrsPg0MGLG_RwkN_6" [label="control_event_arbiter"];
  "n_1AVZPSrsPg0MGLG_RwkN_7" [label="context_event_dispatcher"];
  "n_1AVZPSrsPg0MGLG_RwkN_8" [label="watch_stopwatch_unit"];
  "n_1AVZPSrsPg0MGLG_RwkN_9" [label="sr04_unit"];
  "n_ZRII5WbOuysuoFS_0yGD_3" [label="o_stopwatch_msec"];
  "n_ZRII5WbOuysuoFS_0yGD_4" [label="i_show_humi"];
  "n_ZRII5WbOuysuoFS_0yGD_6" [label="dht11_io"];
  "n_bwpoZiZqISLVeRXRRRad_1" [label="canonical_evt_bus"];
  "n_bwpoZiZqISLVeRXRRRad_102" [label="o_valid"];
  "n_bwpoZiZqISLVeRXRRRad_2" [label="current_context"];
  "n_bwpoZiZqISLVeRXRRRad_24" [label="node_Rad-24"];
  "n_bwpoZiZqISLVeRXRRRad_25" [label="DECISION_UNIT"];
  "n_bwpoZiZqISLVeRXRRRad_26" [label="node_Rad-26"];
  "n_bwpoZiZqISLVeRXRRRad_27" [label="EXECUTE_UNIT"];
  "n_bwpoZiZqISLVeRXRRRad_28" [label="node_Rad-28"];
  "n_bwpoZiZqISLVeRXRRRad_29" [label="node_Rad-29"];
  "n_bwpoZiZqISLVeRXRRRad_3" [label="context_change_pulse"];
  "n_bwpoZiZqISLVeRXRRRad_30" [label="node_Rad-30"];
  "n_bwpoZiZqISLVeRXRRRad_31" [label="stopwatch_unit"];
  "n_bwpoZiZqISLVeRXRRRad_32" [label="sr04_unit"];
  "n_bwpoZiZqISLVeRXRRRad_34" [label="i_btnD"];
  "n_bwpoZiZqISLVeRXRRRad_36" [label="dht11_unit"];
  "n_bwpoZiZqISLVeRXRRRad_37" [label="node_Rad-37"];
  "n_bwpoZiZqISLVeRXRRRad_38" [label="node_Rad-38"];
  "n_bwpoZiZqISLVeRXRRRad_39" [label="node_Rad-39"];
  "n_bwpoZiZqISLVeRXRRRad_4" [label="watch_evt_bus"];
  "n_bwpoZiZqISLVeRXRRRad_40" [label="node_Rad-40"];
  "n_bwpoZiZqISLVeRXRRRad_41" [label="watch_unit"];
  "n_bwpoZiZqISLVeRXRRRad_44" [label="i_btnU"];
  "n_bwpoZiZqISLVeRXRRRad_46" [label="i_btnL"];
  "n_bwpoZiZqISLVeRXRRRad_48" [label="i_sw0"];
  "n_bwpoZiZqISLVeRXRRRad_5" [label="stopwatch_evt_bus"];
  "n_bwpoZiZqISLVeRXRRRad_50" [label="o_stopwatch_hour"];
  "n_bwpoZiZqISLVeRXRRRad_53" [label="o_stopwatch_min"];
  "n_bwpoZiZqISLVeRXRRRad_55" [label="o_stopwatch_sec"];
  "n_bwpoZiZqISLVeRXRRRad_56" [label="i_display_mode"];
  "n_bwpoZiZqISLVeRXRRRad_58" [label="i_btnL/U/D"];
  "n_bwpoZiZqISLVeRXRRRad_6" [label="sr04_refresh_req"];
  "n_bwpoZiZqISLVeRXRRRad_60" [label="i_btnU_hold"];
  "n_bwpoZiZqISLVeRXRRRad_62" [label="i_sw0"];
  "n_bwpoZiZqISLVeRXRRRad_64" [label="i_btnD_hold"];
  "n_bwpoZiZqISLVeRXRRRad_69" [label="SRC/CMD/EVT"];
  "n_bwpoZiZqISLVeRXRRRad_7" [label="dht11_refresh_req"];
  "n_bwpoZiZqISLVeRXRRRad_72" [label="o_watch_live_time"];
  "n_bwpoZiZqISLVeRXRRRad_74" [label="o_watch_set_index"];
  "n_bwpoZiZqISLVeRXRRRad_76" [label="o_watch_set_mode"];
  "n_bwpoZiZqISLVeRXRRRad_78" [label="o_watch_set_time"];
  "n_bwpoZiZqISLVeRXRRRad_8" [label="ACT"];
  "n_bwpoZiZqISLVeRXRRRad_85" [label="i_refresh_req"];
  "n_bwpoZiZqISLVeRXRRRad_87" [label="echo"];
  "n_bwpoZiZqISLVeRXRRRad_89" [label="trig"];
  "n_bwpoZiZqISLVeRXRRRad_9" [label="log_req"];
  "n_bwpoZiZqISLVeRXRRRad_91" [label="o_distance_cm"];
  "n_bwpoZiZqISLVeRXRRRad_93" [label="i_refresh_req"];
  "n_bwpoZiZqISLVeRXRRRad_97" [label="o_humi"];
  "n_bwpoZiZqISLVeRXRRRad_99" [label="o_temp"];
  "n_1AVZPSrsPg0MGLG_RwkN_4" -> "n_1AVZPSrsPg0MGLG_RwkN_1";
  "n_1AVZPSrsPg0MGLG_RwkN_6" -> "n_1AVZPSrsPg0MGLG_RwkN_7";
  "n_bwpoZiZqISLVeRXRRRad_31" -> "n_bwpoZiZqISLVeRXRRRad_31";
}
